function makeWorld(){
    world = [];

    init_width=1200;
    init_height=849;

    cit="Atlanta Chicago Monreal New-York Washington San-Francisco London Madrid Paris Milan Essa St-Peterburg "+
        "Los-Angeles Mexico Mayami Bogota Lima Santyago Lagos Kinshasa Yohansburg Hartum Buenos-Aires San-Paulo "+
        "Алжир Стамбул Москва Багдад Эр-Рияд Карачи Тегеран Дели Мумбай Ченнаи Калькутта Kairo "+
        "Пекин Шанхай Бангкок Джакарта Хошимин Манила Сидней Осака Тайбэй Сеул Токио Гонконг";
    pos="231 330 206 266 289 262 356 270 328 324 101 297 509 221 497 306 570 264 625 244 589 207 682 191 "+
        "119 381 196 409 292 397 282 479 252 567 265 659 560 467 612 524 662 607 666 451 350 644 399 580 "+
        "587 351 662 297 725 248 720 340 728 414 798 365 782 285 860 342 807 426 873 472 918 363 649 366 "+
        "962 268 969 325 928 432 926 541 975 488 1064 487 1107 655 1105 357 1046 381 1038 265 1098 297 978 395";
    rel="14 4 1 ,0 2 5 12 13 ,1 4 3 ,2 4 7 6 ,14 0 2 3 ,12 1 46 41 ,3 7 8 10 ,23 24 8 6 3 ,"+
        "6 7 24 9 10 ,8 25 10 ,6 8 9 11 ,10 25 26 ,5 1 13 42 ,12 14 15 16 1 ,"+
        "13 15 0 4 ,13 14 16 23 22 ,17 15 13 ,16 ,23 19 21 ,18 21 20 ,19 21 ,18 19 20 35 ,15 23 ,22 15 7 18 ,"+
        "7 8 25 35 ,24 9 11 26 27 35 ,11 25 27 30 ,35 25 26 30 29 28 ,35 27 29 ,28 27 30 31 32 ,26 27 29 31 ,"+
        "30 29 32 33 34 ,29 31 33 ,32 31 34 38 39 ,31 33 38 47 ,24 25 27 28 21 ,37 45 ,36 45 46 43 44 47 ,33 34 47 40 39 ,"+
        "33 38 40 42 ,39 38 47 41 ,40 47 44 42 5 ,12 39 41 ,44 46 ,41 47 37 43 ,36 37 46 ,45 37 43 5 ,38 34 37 44 41 40";

    var cit_ar=cit.split(" ");
    var pos_ar=pos.split(" ");
    var rel_ar=rel.split(" ,");

    for (let i=0;i<cit_ar.length;i++){
        world.push(new city(cit_ar[i], Math.floor(i/12),rel_ar[i].split(" "),pos_ar[Math.floor(i*2)], pos_ar[Math.floor(i*2)+1]));
    }
    return world;
}